In [1]:
import pandas as pd

# Date/Time Conversion

In [2]:
df = pd.DataFrame({
    "OrderID": [1, 2, 3, 4],
    "OrderDate": ["2023-01-10", "2023-02-15", "2023-03-01", "2023-07-22"],
    "Amount": [5000, 6200, 4500, 7800]
})

df

   OrderID   OrderDate  Amount
0        1  2023-01-10    5000
1        2  2023-02-15    6200
2        3  2023-03-01    4500
3        4  2023-07-22    7800

## 1. Converting date column to datetime

In [3]:
df.dtypes

OrderID       int64
OrderDate    object
Amount        int64
dtype: object

In [5]:
df["OrderDate"] = pd.to_datetime(df["OrderDate"])

In [14]:
df.dtypes

OrderID               int64
OrderDate    datetime64[ns]
Amount                int64
dtype: object

## 2. Extract Year, Month, Day

In [15]:
df["Year"] = df["OrderDate"].dt.year
df["Month"] = df["OrderDate"].dt.month
df["Day"] = df["OrderDate"].dt.day
df

   OrderID  OrderDate  Amount  Year  Month  Day
0        1 2023-01-10    5000  2023      1   10
1        2 2023-02-15    6200  2023      2   15
2        3 2023-03-01    4500  2023      3    1
3        4 2023-07-22    7800  2023      7   22

## 3. Extracting Day name and Month name

In [23]:
df["Day_name"] = df["OrderDate"].dt.day_name()
df["Month_name"] = df["OrderDate"].dt.month_name()
df

   OrderID  OrderDate  Amount  Year  Month  Day   Day_name Month_name
0        1 2023-01-10    5000  2023      1   10    Tuesday    January
1        2 2023-02-15    6200  2023      2   15  Wednesday   February
2        3 2023-03-01    4500  2023      3    1  Wednesday      March
3        4 2023-07-22    7800  2023      7   22   Saturday       July

## 4. Extract week number, Quarter

In [24]:
df["Week"] = df["OrderDate"].dt.isocalendar().week
df["Quarter"] = df["OrderDate"].dt.quarter
df

,OrderID,OrderDate,Amount,Year,Month,Day,Day_name,Month_name,Week,Quarter
0,1,2023-01-10,5000,2023,1,10,Tuesday,January,2,1
1,2,2023-02-15,6200,2023,2,15,Wednesday,February,7,1
2,3,2023-03-01,4500,2023,3,1,Wednesday,March,9,1
3,4,2023-07-22,7800,2023,7,22,Saturday,July,29,3

## 5. Check min/max date

In [27]:
df["OrderDate"].min()

Timestamp('2023-01-10 00:00:00')

In [28]:
df["OrderDate"].max()

Timestamp('2023-07-22 00:00:00')

## 6. Filter by DateTime

In [30]:
df[df["OrderDate"] > "2023-05-02"]

,OrderID,OrderDate,Amount,Year,Month,Day,Day_name,Month_name,Week,Quarter
3,4,2023-07-22,7800,2023,7,22,Saturday,July,29,3

## 7. Custom date format conversion

| Format | Meaning |
| - | - |
| %d     | Day     |
| %m     | Month   |
| %Y     | Year    |
| %H     | Hour    |
| %M     | Minute  |
| %S     | Second  |

In [56]:
df2 = pd.DataFrame({
    "Date": ["10-10-2023","20-10-2024","30-10-2025"]
})
df2

         Date
0  10-10-2023
1  20-10-2024
2  30-10-2025

In [58]:
pd.to_datetime(df2["Date"], format="%d-%m-%Y")

0   2023-10-10
1   2024-10-20
2   2025-10-30
Name: Date, dtype: datetime64[ns]

## 8. Working with timestamps

`"YYYY-MM-DD HH:MM:SS"`

In [50]:
pd.to_datetime("2023-01-10 14:30:00")

Timestamp('2023-01-10 14:30:00')

## 9. Handle invalid dates

In [49]:
pd.to_datetime(df["OrderDate"], errors="coerce")

0   2023-01-10
1   2023-02-15
2   2023-03-01
3   2023-07-22
Name: OrderDate, dtype: datetime64[ns]